using System.Collections.Generic;
using UnityEngine;

/// <summary>
/// 司令官
/// 只负责管理部队、侦察兵、切换逻辑，**没有任何状态行为代码**
/// </summary>

public class 状态机司令官: MonoBehaviour
{
    [Header("巡逻地点")]
    public Transform[] 巡逻地点;
    [Header("玩家目标")]
    public Transform playerTrans;
    //部队仓库字典，**添加存放全部所有部队实例**，用 ID 快速查找对应部队
    private Dictionary<状态ID, 部队> 部队仓库 = new Dictionary<状态ID, 部队>();
    //单个变量，**记录现在正在上岗干活的那一个部队**
    private 部队 当前部队;
    //侦察兵小队列表，**存放所有侦察兵实例**，每帧挨个询问侦察兵有没有敌情
    private List<侦察兵> 侦察兵小队 = new List<侦察兵>();

/// =============================<summary>=============================
/// 初始化部队仓库
///============================= </summary>=============================
    void 初始化部队仓库()
        {
            var 待机部队 = new 部队_待机();//该部队变量名为【待机部队】 类型是部队（class类，实例盒子）
            //创建部队实例 子类实例已经创建（躯体造好了，父类`部队`的构造函数也自动执行）是：**`本部队ID`（部队的工牌）还没有赋值，是空的**
            待机部队.Init(this.gameObject);//做内部准备 → 初始化
            待机部队.本部队ID = 状态ID.待机;//设置部队状态ID=待机 类型是状态ID 枚举类型 类型不同所以不能让 待机部队=状态ID.待机
            //- `待机部队`：士兵实例
            //- `.本部队ID`：士兵身上自带的一个口袋，专门用来存放工牌（类型正好是`状态ID`枚举）
            //- 含义：把【状态 ID. 待机】这张纸片，放到士兵自带的工牌口袋里。
            待机部队.战斗手册.Add(触发ID.看见敌人, 状态ID.追击);
            //添加战斗手册 = new Dictionary<触发ID,  状态ID>();触发ID=看见敌人 (目标)状态ID=攻击敌人
            //战斗手册说明：如果当前在岗部队是【待机部队】，并且收到【看见敌人】这个触发消息 → 状态ID为【攻击敌人】切到 追击部队。
            //每个部队（状态）都有**自己独立的战斗手册**   
            //司令官拿到侦察兵上报的【触发 ID】之后，**去查【当前在岗那支部队】自带的战斗手册**。
            部队仓库.Add(状态ID.待机, 待机部队);//【将待机部队】 添加到仓库字典
            // ✅ 新增：收到等待结束 → 切换巡逻
            待机部队.战斗手册.Add(触发ID.等待结束, 状态ID.巡逻);


            var 巡逻部队 = new 部队_巡逻();//该巡逻部队变量名为【巡逻部队】
            巡逻部队.Init(this.gameObject);//
            巡逻部队.巡逻路点 = 巡逻地点;//绑定巡逻路点传给 巡逻部队
            //- `巡逻路点`：巡逻部队身上自带的一个口袋，专门用来存放巡逻路点（类型正好是`Transform[]`数组）
            //- 含义：把【巡逻路点】这张纸片，放到巡逻部队自带的巡逻路点口袋里。
            巡逻部队.本部队ID = 状态ID.巡逻;//设置部队状态ID=巡逻
            巡逻部队.战斗手册.Add(触发ID.看见敌人, 状态ID.追击);
            //战斗手册说明：如果当前在岗部队是【巡逻部队】，并且收到【看见敌人】这个触发消息 → (目标)状态ID为【追击】切到 追击部队。
            部队仓库.Add(状态ID.巡逻, 巡逻部队);//将巡逻部队添加到仓库字典

            var 追击部队 = new 部队_追击();//该追击部队变量名为【追击部队】
            追击部队.Init(this.gameObject);
            追击部队.玩家目标 = playerTrans; //玩家引用传给追击状态
            追击部队.本部队ID = 状态ID.追击;//设置部队状态ID=追击
            追击部队.战斗手册.Add(触发ID.敌人消失, 状态ID.巡逻); 
            //战斗手册说明：如果当前在岗部队是【追击部队】，并且收到【敌人消失】这个触发消息 → (目标)状态ID为【巡逻】切换为 巡逻部队。
            部队仓库.Add(状态ID.追击, 追击部队);//将追击部队添加到仓库字典

        }

    void 初始化侦察兵仓库()//list添加了 侦察兵类型 对应 触发ID
        {
            var 侦察看见敌人 = new 侦察兵_看见敌人();//创建侦察兵实例 盒子躯体已实例但盒子工牌是空的
            侦察看见敌人.Init(触发ID.看见敌人);//挂牌，写入触发编号
            // public override void Init(触发ID id)   id=看见敌人
            //重置工牌改为 触发ID(枚举)里保存的 public override void Init(触发ID 看见敌人)
            侦察看见敌人.自身 = this.gameObject;
            侦察看见敌人.目标敌人 = playerTrans.gameObject;
            侦察兵小队.Add(侦察看见敌人);//将侦察兵添加到侦察兵小队List

            var 侦察敌人消失 = new 侦察兵_敌人消失();
            侦察敌人消失.Init(触发ID.敌人消失);//工牌为 敌人消失
            侦察敌人消失.自身 = this.gameObject;
            侦察敌人消失.目标敌人 = playerTrans.gameObject;
            //- `playerTrans`：只代表【位置组件】
            //- `playerTrans.gameObject`：代表整个【玩家物体 Player】
            侦察兵小队.Add(侦察敌人消失);//将侦察兵添加到侦察兵小队List

            var 侦察待机计时 = new 侦察兵_待机计时();
            侦察待机计时.Init(触发ID.等待结束);
            侦察兵小队.Add(侦察待机计时);
        } 
/// =============================<summary>=============================
/// 切换部队状态
///============================= </summary>
/// <param name="新部队ID"></param>
    void 切换部队(状态ID 新部队ID)//需要输入 状态ID（自定义枚举类型 包含枚举常量：待机 巡逻 追击） 新部队ID只能在枚举类型里选择
        {
            当前部队?.离开状态();//`?.` 空条件运算符：如果`当前部队`不为 null，才执行`离开状态()`
            当前部队 = 部队仓库[新部队ID];//拿着`新部队ID`去司令官的【部队仓库】字典，取出对应的部队实例，赋值给`当前部队`变量。
            当前部队.进入状态();//通知**新部队上岗**，执行进入逻辑（播放进入动画、初始化本次状态的数据）
            Debug.Log("切换状态：" + 当前部队.本部队ID); // ✅ 仅切换时打印一次
        }   

/// =============================<summary>=============================
/// 初始化所有部队实例，存入仓库
///============================= </summary>=============================
    void Awake()
    {
        // 创建所有部队实例，存入仓库
        初始化部队仓库();
        //侦察兵小队：创建所有侦察兵实例，存入列表
        初始化侦察兵仓库();
        // 默认初始状态
        切换部队(状态ID.待机);
        
    }
/// =============================<summary>==============================
/// 每帧询问侦察兵是否有触发消息 ，如果有，就切换部队状态
///============================= </summary>=============================
    void Update()
    {
        // 每帧询问侦察兵是否有触发消息 ，如果有，就切换部队状态
        当前部队?.状态更新();//当前部队不为null，才执行`状态更新()
        foreach(var 侦察兵 in 侦察兵小队)//遍历所有侦察兵小队里的侦察兵
        {
            if(侦察兵.检测条件())//如果侦察兵有触发消息 bool 检测条件()=true
            {
                // 触发ID：自定义枚举类型，枚举常量：看见敌人、敌人消失
                // 读取侦察兵实例身上的工牌【触发编号】，把值赋值给局部变量【收到消息】
                // 【收到消息】的类型是触发ID(自定义枚举类型)，临时存放本次侦察兵上报的事件代号
                触发ID 收到消息 = 侦察兵.触发编号; 
                if (当前部队.战斗手册.ContainsKey(收到消息))// 如果当前在岗部队的战斗手册中，存在【收到消息】这个触发ID（看见敌人/敌人消失）
                {
                    // 状态ID：自定义枚举类型，枚举常量：待机、巡逻、追击
                    // 从当前部队的战斗手册里取出【收到消息】对应的【目标状态ID】
                    // 例子：当前在岗是待机，收到触发ID【看见敌人】，对应的目标状态ID是【追击】
                    状态ID 目标ID = 当前部队.战斗手册[收到消息];//拿到的目标ID=状态ID(自定义枚举类型)里的 （追击）
                    切换部队(目标ID);//调用切换部队函数void 切换部队(状态ID 新部队ID)，目标ID给新部队ID，切换部队状态
                    break;
                    // 一个侦察兵只能触发一次，所以跳出循环
                }
            }
        }
    }
}
